## PRACTICE EXERCISE

**Objective:**
Practice performing CRUD operations (Create, Read, Update, Delete) on a database table.

**Perform the following tasks:**
1. Create a new table named `Books`, with the following columns:
  * BookID (Primary Key, Auto-increment)
  * Title (Title of the book)
  * Author (Author of the book)
  * Genre (Genre of the book)
  * Publication_Year (Year of publication)
  * Price (Price of the Book)
2. Insert at least 3 new books into the `Books` table.
3. Retrieve all books from the Books table.
4. Update the price of a specific book.
5. Delete a book from the table.

In [4]:
# Load the ipython-sql extension
%load_ext sql

In [5]:
# Connect to the SQLite database (create it if it doesn't exist)
%sql sqlite:///books.db

In [6]:
%%sql
CREATE TABLE IF NOT EXISTS Books (
    BookID INTEGER PRIMARY KEY AUTOINCREMENT,
    Title TEXT NOT NULL,
    Author TEXT NOT NULL,
    Genre TEXT NOT NULL,
    Publication_Year INTEGER NOT NULL,
    Price REAL NOT NULL
);

 * sqlite:///books.db
Done.

[]

In [7]:
%%sql
INSERT INTO Books (Title, Author, Genre, Publication_Year, Price) VALUES
('To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 10.99),
('1984', 'George Orwell', 'Dystopian', 1949, 8.99),
('The Great Gatsby', 'F. Scott Fitzgerald', 'Classic', 1925, 12.99);

 * sqlite:///books.db
3 rows affected.

[]

In [8]:
%sql SELECT * FROM Books;

 * sqlite:///books.db
Done.

[(1, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 10.99),
 (2, '1984', 'George Orwell', 'Dystopian', 1949, 8.99),
 (3, 'The Great Gatsby', 'F. Scott Fitzgerald', 'Classic', 1925, 12.99)]

In [9]:
%sql UPDATE Books SET Price = 9.99 WHERE Title = '1984';

 * sqlite:///books.db
1 rows affected.

[]

In [10]:
%sql DELETE FROM Books WHERE Title = 'The Great Gatsby';

 * sqlite:///books.db
1 rows affected.

[]

In [11]:
%sql SELECT * FROM Books;

 * sqlite:///books.db
Done.

[(1, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 10.99),
 (2, '1984', 'George Orwell', 'Dystopian', 1949, 9.99)]